brew "autoconf"
brew "automake"
brew "ccache"
brew "cmake"
brew "direnv"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "htop"
brew "jq"
brew "mas"
brew "mise"
brew "nano"
brew "ripgrep"
brew "tree"
brew "watch"
brew "wget"
