# Brewfile — declarative package list for Homebrew Bundle
# Run `brew bundle` to install everything, or `brew bundle dump` to regenerate from what's currently installed.

# Taps
tap "homebrew/cask-fonts"

# Fonts
cask "font-meslo-lg-nerd-font"  # terminal (Powerlevel10k icons)
cask "font-fira-code"            # editor (ligatures)
cask "font-jetbrains-mono"      # primary coding font

# CLI tools
brew "mas"
brew "wget"
brew "tree"
brew "htop"
brew "watch"
brew "node"
brew "python3"
brew "R"
brew "pandoc"
brew "pandoc-citeproc"
brew "hugo"
brew "ffmpeg"
brew "imagemagick@6"
brew "graphicsmagick"
brew "youtube-dl"
brew "lftp"
brew "cmake"
brew "ccache"
brew "autoconf"
brew "automake"
brew "pkg-config"
brew "llvm"
brew "openblas"
brew "eigen"
brew "armadillo"
brew "udunits"
brew "gdal"
brew "cairo"
brew "librsvg"
brew "libsvg"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "libxml2"
brew "pixman"
brew "nano"
brew "gh"
brew "mise"
brew "ripgrep"
brew "fd"
brew "jq"
brew "fzf"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# GUI apps
cask "google-chrome"
cask "brave-browser"
cask "visual-studio-code"
cask "iterm2"
cask "vlc"
cask "flux"
cask "color-oracle"
cask "docker"
cask "spectacle"
cask "dropbox"
cask "adobe-acrobat-reader"
cask "xquartz"
