tap "alexsjones/llmfit"
tap "drmowinckels/entracte", "https://github.com/drmowinckels/entracte"
brew "llvm"
brew "eigen"
brew "openblas"
brew "armadillo"
brew "autoconf"
brew "automake"
brew "gettext"
brew "freetype"
brew "fontconfig"
brew "pixman"
brew "cairo"
brew "cask"
brew "ccache"
brew "cmake"
brew "direnv"
brew "espeak-ng"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "pkgconf"
brew "libxml2"
brew "gdal"
brew "gh"
brew "git"
brew "graphicsmagick"
brew "htop"
brew "hugo"
brew "imagemagick@6"
brew "jq"
brew "lftp"
brew "libgit2"
brew "librsvg"
brew "libsvg"
brew "mas"
brew "mise"
brew "nano"
brew "node"
brew "pandoc"
brew "r"
brew "ripgrep"
brew "tree"
brew "udunits"
brew "uv"
brew "watch"
brew "wget"
brew "yt-dlp"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "alexsjones/llmfit/llmfit", trusted: true
cask "adobe-acrobat-reader"
cask "basictex"
cask "brave-browser"
cask "claude"
cask "color-oracle"
cask "discord"
cask "docker-desktop"
cask "dropbox"
cask "drmowinckels/entracte/entracte"
cask "flux-app"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "google-chrome"
cask "iterm2"
cask "nextcloud"
cask "obsidian"
cask "qbittorrent"
cask "quarto"
cask "rar"
cask "rectangle"
cask "slack"
cask "visual-studio-code"
cask "vlc"
cask "xquartz"
mas "Keynote", id: 409183694
mas "Keynote", id: 361285480
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "Todoist", id: 585829637
mas "Trello", id: 1278508951
mas "WhatsApp", id: 310633997
vscode "anthropic.claude-code"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "atomiks.moonlight"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.path-intellisense"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "foxundermoon.shell-format"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "ivan-bocharov.stan-vscode"
vscode "jdinhlife.gruvbox"
vscode "johnpapa.winteriscoming"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-chat-customizations-evaluations"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "quarto.quarto"
vscode "rdebugger.r-debugger"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "reditorsupport.r-syntax"
vscode "robbowen.synthwave-vscode"
vscode "sdras.night-owl"
vscode "teabyii.ayu"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "xyz.local-history"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
npm "@alibaba-group/open-code-review"
npm "@gsd-build/sdk"
npm "codeburn"
npm "pnpm"
