anthropic.claude-code
arcticicestudio.nord-visual-studio-code
atomiks.moonlight
catppuccin.catppuccin-vsc
christian-kohler.path-intellisense
dracula-theme.theme-dracula
eamodio.gitlens
editorconfig.editorconfig
enkia.tokyo-night
foxundermoon.shell-format
github.copilot-chat
github.github-vscode-theme
github.vscode-pull-request-github
gruntfuggly.todo-tree
jdinhlife.gruvbox
johnpapa.winteriscoming
mechatroner.rainbow-csv
mhutchie.git-graph
monokai.theme-monokai-pro-vscode
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.remote-explorer
pkief.material-icon-theme
quarto.quarto
rdebugger.r-debugger
redhat.vscode-yaml
reditorsupport.r
reditorsupport.r-syntax
robbowen.synthwave-vscode
sdras.night-owl
teabyii.ayu
timonwong.shellcheck
usernamehw.errorlens
vira.vsc-vira-theme
xyz.local-history
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
